{"basics":{"name":"Ahmad Rahimi","label":"Ph.D. Student","image":"","email":"ahmad.rahimi@epfl.ch","phone":"+41 76 266 94 37","url":"https://AhmadRHM.github.io/","summary":"I am a Ph.D. student in the VITA group at EPFL. My research interests include deep learning and computer vision for autonomous driving.","location":{"address":"Rue des Fontenailles 18","postalCode":"1007","city":"Lausanne","countryCode":"CH","region":"Vaud"}},"interests":[{"name":"Deep Learning","icon":"fa-solid fa-tag","keywords":["Computer Vision","World Modeling","Video Prediction","Trajectory Prediction","Autonomous Driving"]}],"education":[{"institution":"Ecole Polytechnique Fédérale de Lausanne (EPFL), Lausanne, Switzerland","location":"Lausanne, Switzerland","url":"https://www.epfl.ch/","area":"Computer Science","studyType":"PhD","startDate":"2022-09-15"},{"institution":"Sharif University of Technology, Tehran, Iran","location":"Tehran, Iran","url":"https://www.sharif.edu/","area":"Computer Science","studyType":"BSc","startDate":"2018-09-01","endDate":"2022-06-01","gpa":"18.88/20"}],"publications":[{"name":"GEM: A Generalizable Ego-vision Multimodal World Model for Fine-Grained Ego-Motion, Object Dynamics, and Scene Composition Control","publisher":"CVPR 2025","releaseDate":"2024-12-03","url":"https://ahmadrhm.github.io/","summary":"We propose a generalizable ego-vision multimodal world model, GEM, that learns to predict future frames of egocentric driving videos, compromising various control signals. We build on pre-trained stable video diffusion model, adding a number of new features to incorporate controlability to the model and unleash long-term generation capabilities."},{"name":"A Multi-Loss Strategy for Vehicle Trajectory Prediction: Combining Off-Road, Diversity, and Directional Consistency Losses","publisher":"Under review","releaseDate":"2024-12-02","url":"https://ahmadrhm.github.io/","summary":"Traditionally, trajectory prediction models are trained using minADE losses, which only penalize the closest prediction to the ground truth. This sparsification of the loss function slows down model convergence and may lead to suboptimal predictions for less trained prediction heads. In this work, we propose a multi-loss strategy that combines off-road, diversity, and directional consistency losses which act on all prediction modes and improve the performance of trajectory prediction models."},{"name":"Sim-to-Real Causal Transfer: A Metric Learning Approach to Causally-Aware Interaction Representations","publisher":"CVPR 2025","releaseDate":"2023-12-07","url":"https://ahmadrhm.github.io/","summary":"We investigate causal understanding in the context of multi agent interaction prediction, where removing non-causal agents from the scene should not change model's prediction. We show modern prediction models are able to identify non-causal agents in the scene, but fail to properly model causal agent removals. We propose a metric learning approach to learn causally-aware interaction representations, which we show lead to better generalizability and robustness for Out of Distribution (OOD) and low-data regime scenarios."},{"name":"Vehicle trajectory prediction works, but not everywhere","publisher":"CVPR 2022","releaseDate":"2022-03-29","url":"https://s-attack.github.io/scene-attack/","summary":"We show that current trajectory prediction models fail to fully understand scene structure, where naturalistic perturbations in the scene, like introducing turns, can significantly affect the prediction quality of the model. We propose a scene attack method to evaluate the robustness of trajectory prediction models against such perturbations, and further show improvements of the models when trained with these adversarial examples."}],"awards":[{"title":"Bronze Medal in INOI","date":"2017-09-01","awarder":"Iranian National Olympiad in Informatics","url":"https://inoi.ir/","summary":"Awarded the Bronze Medal in the Iranian National Olympiad in Informatics (INOI) for my performance in the competition which compromises algorithmic and combinatorial questions, in both theoretical and practical aspects."},{"title":"Ranked Second in !Optimizer Competition","date":"2021-09-01","awarder":"Sharif University of Technology","url":"https://www.sharif.edu/","summary":"Ranked second in the !Optimizer competition, a competition held by the computer science department at Sharif University of Technology, which evaluates students' knowledge in optimization."},{"title":"Ranked 403 in Nation-wide university entrance exam","date":"2018-09-01","awarder":"Iranian National Evaluation Organization","url":"https://www.sanjesh.org/","summary":"Ranked 403 in the nation-wide university entrance exam, among more than 300,000 participants in Iran (placed in top 0.2% of the participants)."},{"title":"Ranked Third in Developers Competition","date":"2019-12-07","awarder":"Sharif University of Technology","url":"https://www.sharif.edu/","summary":"Ranked third in the developers competition, a competition held by the computer engineering department at Sharif University of Technology, which evaluates students' knowledge in web development."}],"volunteer":[{"organization":"Iranian Student Association (IRSA)","location":"Lausanne, Switzerland","position":"President","url":"https://www.epfl.ch/campus/associations/list/irsa/","startDate":"2023-08-01","endDate":"2024-08-01","summary":"President of Iranian Student Association at EPFL, where I organized various cultural events and workshops for Iranian students at EPFL."},{"organization":"Student Scentific Association","location":"Tehran, Iran","position":"President","url":"https://hamband.math.sharif.edu/wiki/","startDate":"2019-06-01","endDate":"2020-07-01","summary":"President of the Student Scientific Association in Department of Mathematical Sciences at Sharif University of Technology, where I organized various scientific events and workshops for students."},{"organization":"Sharif Math Summer School","location":"Tehran, Iran","position":"Lead Organizer","url":"https://hamband.math.sharif.edu/wiki/","startDate":"2019-08-01","endDate":"2019-08-04","summary":"Lead organizer of the Sharif Math Summer School, a summer school for high school students to familiarize them with various mathematical fields. I was also the lead of the cryptography workshop."},{"organization":"Code Knock 3","location":"Tehran, Iran","position":"Organizer","url":"https://hamband.math.sharif.edu/wiki/","startDate":"2020-01-09","endDate":"2020-01-10","summary":"Organizer of Code Knock 3, a competitive programming competition in Java held at Sharif University of Technology."}],"skills":[{"name":"Machine Learning/Deep Learning","level":"Expert","icon":"fa-solid fa-hashtag","keywords":["PyTorch","TensorFlow","Keras","Scikit-learn","OpenCV"]},{"name":"Programming","level":"Expert","icon":"fa-solid fa-code","keywords":["Python","C++","Java"]},{"name":"Tools","level":"Intermediate","icon":"fa-solid fa-tools","keywords":["Git","Docker","Jupyter","PyCharm"]}],"languages":[{"language":"Persian","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""},{"language":"French","fluency":"Intermediate","icon":""}],"references":[{"name":"Professor Alexandre Alahi","icon":"fa-solid fa-laptop","reference":"He is my current PhD advisor at EPFL. He is an expert in computer vision and deep learning for autonomous driving, and has published numerous papers in top-tier conferences."},{"name":"Seyed Mohsen Moosavi-Dezfooli","icon":"fa-solid fa-thumbtack","reference":"He was a supervisor for an internship I did at EPFL and we have published a paper together. He is an expert in adversarial machine learning and has published numerous papers in top-tier conferences."}]}